# ElementId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementId Properties
ElementId Class See Also
---
The ElementId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IntegerValue | **Obsolete.** Provides the value of the element id as a 32-bit integer. |
| InvalidElementId | Get the invalid ElementId whose value is -1. |
| Value | Provides the value of the element id as a 64-bit integer. |

# See Also
ElementId Class
Autodesk.Revit.DB Namespace